{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Charlie Park!",
  "home_page_url": "https://charliepark.org/",
  "feed_url": "https://charliepark.org/feed.json",
  "icon": "https://charliepark.org/images/arrow_for_feed.jpg",
  "favicon": "https://charliepark.org/favicon.ico",
  "language": "en-US",
  "items": [
  
    {
      "id": "https://charliepark.org/fern/",
      "url": "https://charliepark.org/fern/",
      "content_html": "<p><img src='/images/fern.jpg' alt='Our dog, Fern, looking noble.'></p><p>Fern is a very good girl.</p>"
    },
  
    {
      "id": "https://charliepark.org/tutorials_over_libraries/",
      "url": "https://charliepark.org/tutorials_over_libraries/",
      "content_html": "<h1>Tutorials Over Libraries</h1><p>Andy Bell published a new tutorial today, on <a href='https://piccalil.li/tutorial/build-a-responsive-media-browser-with-css/'>how to build a responsive media browser with CSS</a>. It’s a great runthrough of how he did it, and I especially like his 16:9 aspect ratio trick for the media object. It’s clever, while still being clear — a line that’s surprisingly hard for many developers to walk. And Andy does a great job talking through some of the reasoning behind different decisions, like some choices he made in the service of universal design.</p><p>So the article’s great, but what I really want to write about here is how much I appreciate that he wrote it up as a <em>tutorial</em> and not as a <em>library</em>.</p><p>An aspect of “the old web” that I miss is people writing up how they solved different technical challenges. I’m guilty of this, too. To be sure, people still do write things up, but it seems like it’s far more common for people to create a JavaScript module and to release it on NPM these days. “Hey, world. Here’s a ready-to-go responsive media browser! I’ve hidden the complicated parts so you don’t need to worry about them.”</p><p>Matthew Crawford — motorcycle mechanic and philosophy/sociology research fellow at UVA — talks about this principle (and how damaging it can be) a fair amount in his book <em>Shop Class As Soul Craft</em>. In his case, he talks about the evolution of the dipstick in the car. When cars first came out, you couldn’t own one unless you knew how the internal parts worked together. Over time, car mechanics began to take on that work, and car owners only needed to check their engine oil level every once in a while. Then came the “check engine” light. Later, the OBD-II monitor, which required not only specialized knowledge, but specialized hardware and software. Ultimately, some cars didn’t even have a dipstick accessible to the owner, and it could only be serviced by taking it in to the dealer. (Rent-seeking isn’t only present in the SaaS world.)</p><p><em>Yes</em>, being freed from having to deal with “the complicated parts” meant that people were freed to do other (presumably more valuable) things with their time. And there’s something to be said for an external library that’s properly tested versus your own homespun version. But that external reliance comes at a cost of knowing your own tools and honing your craft. Of understanding the bespoke decisions that go into developing the particular thing you’re making, and of learning about both common pitfalls and edge cases to account for. Of knowing how to fix things when the externally-provided library doesn’t work any longer.</p><p>So I think there’s a lot to be said for getting your hands dirty and — yes — duplicating work that others have done.</p><p>Tutorials, like the one that Andy wrote, are one of the best things about the web, and are so much richer than a comparable package/module/component. I’d love to see more people writing up their processes, and showing off how they build things. And, ultimately, showing the rest of us how we, too, can build something similar.</p>"
    },
  
    {
      "id": "https://charliepark.org/make_that_dream_a_reality/",
      "url": "https://charliepark.org/make_that_dream_a_reality/",
      "content_html": "<p>Think of all the time and energy we all must presently devote to the outbursts driven by Trump’s bottomless appetite for attention. Imagine having that psychic burden lifted. Envision the name Trump appearing only in the headlines of below-the-fold stories about criminal investigations and civil lawsuits. Now vote, and make that dream a reality.</p><p>Eugene Robinson — <a href='https://www.washingtonpost.com/opinions/imagine-what-it-will-be-like-to-never-have-to-think-about-trump-again/2020/10/01/d0b32de0-0413-11eb-a2db-417cddf4816a_story.html?utm_source=rss&amp;utm_medium=referral&amp;utm_campaign=wp_opinions'>Imagine what it will be like to never have to think about Trump again</a></p>"
    },
  
    {
      "id": "https://charliepark.org/america_is_doomed_the_musical/",
      "url": "https://charliepark.org/america_is_doomed_the_musical/",
      "content_html": "<iframe title='New York Times Video - Embed Player' width='480' height='321' frameborder='0' scrolling='no' allowfullscreen='true' marginheight='0' marginwidth='0' id='nyt_video_player' src='https://www.nytimes.com/video/players/offsite/index.html?videoId=100000007370133'></iframe><p>Was just wondering last week about the Gregory Brothers and what they’re up to these days. Here we go.</p>"
    },
  
    {
      "id": "https://charliepark.org/voting_cheatsheet/",
      "url": "https://charliepark.org/voting_cheatsheet/",
      "content_html": "<h1>SF Voting Cheatsheet</h1><p>I’m a big fan of <a href='http://www.theleaguesf.org'>The League of Pissed Off Voters</a> and the guides they make each year. They have a more comprehensive guide on the way, but they’ve posted a <a href='http://www.theleaguesf.org/november_2020_cheat_sheet'>cheatsheet</a> in case you’re voting early.</p><p>I look forward to their more nuanced writeups on some of the propositions, but it’s good to have a general sense of their positions. I’m really hoping folks in District 1 pay attention and vote for <a href='conniechansf.com/'>Connie Chan</a>.</p>"
    },
  
    {
      "id": "https://charliepark.org/coaching/",
      "url": "https://charliepark.org/coaching/",
      "content_html": "<h1>Get You a Coach for Great Good!</h1><p>So I’ve benefitted greatly from working with a therapist over the last year. (<a href='https://www.golodner.com/'>This is mine.</a>) He asks great questions, has helped me better understand both myself and my relationships, and has helped me train my ability to get work done more effectively. I highly recommend working with a therapist or coach if you can.</p><p>A good friend of mine is also an excellent coach, and has recently opened up a few slots for new clients. If you’re interested, she’ll give you a free session to see if you click. You can check her out and sign up for a free session here: <a href='https://www.lane.coach/'>Coaching With Lane</a>. It’s kind of incredible how insightful she is, and how quickly she picks up on little things you say / don’t say, and follows up with just the right amount of curiosity to make you pause, reflect, and open a new door of understanding. It’s pretty wild, to be honest.</p><p>If you’ve been thinking about finding a coach, but have been waiting for a sign, consider this the sign and check out her coaching. There are few uses of your precious time that’ll be more useful than reaching out to see if she can help you get unstuck.</p>"
    },
  
    {
      "id": "https://charliepark.org/no_place_on_earth/",
      "url": "https://charliepark.org/no_place_on_earth/",
      "content_html": "<p>There is no place on earth so beautiful as Tamalpaias.</p><p>Robert Louis Stevenson, from the top of Mount Tam</p>"
    },
  
    {
      "id": "https://charliepark.org/twilight_in_the_wilderness/",
      "url": "https://charliepark.org/twilight_in_the_wilderness/",
      "content_html": "<p><img src='/images/twilight_in_the_wilderness.jpg' alt='A painting of a sun setting over a river, with a mountain in the distance. The clouds are illuminated in reds and blues.'></p><p>Frederic Edwin Church — <em>Twilight in the Wilderness</em></p>"
    },
  
    {
      "id": "https://charliepark.org/the_machine/",
      "url": "https://charliepark.org/the_machine/",
      "content_html": "<p>In the first chapter, a disagreement develops between the narrator and his riding companions, John and Sylvia, over the question of motorcycle maintenance. Robert performs his own maintenance, while John and Sylvia insist on having a professional do it. This posture of non-involvement, we soon learn, is a crucial element of their countercultural sensibility. They seek escape from “the whole organized bit” or “the system,” as the couple puts it; technology is a death force, and the point of hitting the road is to leave it behind. The solution, or rather evasion, that John and Sylvia hit on for managing their revulsion at technology is to “Have it somewhere else. Don’t have it here.” The irony is they still find themselves entangled with The Machine—the one they sit on.</p><p>Today, we often use “technology” to refer to systems whose inner workings are assiduously kept out of view, magical devices that offer no apparent friction between the self and the world, no need to master the grubby details of their operation. The manufacture of our smartphones, the algorithms that guide our digital experiences from the cloud—it all takes place “somewhere else,” just as John and Sylvia wished.</p><p>Yet lately we have begun to realize that this very opacity has opened new avenues of surveillance and manipulation. Big Tech now orders everyday life more deeply than John and Sylvia imagined in their techno-dystopian nightmare. Today, a road trip to “get away from it all” would depend on GPS, and would prompt digital ads tailored to our destination. The whole excursion would be mined for behavioral data and used to nudge us into profitable channels, likely without our even knowing it.</p><p>Matthew Crawford, <em><a href='https://www.smithsonianmag.com/smithsonian-institution/robert-pirsig-zen-art-motorcycle-maintenance-resonates-today-180975768/'>Why Robert Pirsig’s ‘Zen and the Art of Motorcycle Maintenance’ Still Resonates Today</a></em></p>"
    },
  
    {
      "id": "https://charliepark.org/he_will_never_concede/",
      "url": "https://charliepark.org/he_will_never_concede/",
      "content_html": "<p>Let us not hedge about one thing. Donald Trump may win or lose, but he will never concede. Not under any circumstance. Not during the Interregnum and not afterward. If compelled in the end to vacate his office, Trump will insist from exile, as long as he draws breath, that the contest was rigged.</p><p>Trump’s invincible commitment to this stance will be the most important fact about the coming Interregnum. It will deform the proceedings from beginning to end. We have not experienced anything like it before.</p><p><a href='https://www.theatlantic.com/magazine/archive/2020/11/what-if-trump-refuses-concede/616424/'>The Election That Could Break America</a></p>"
    },
  
    {
      "id": "https://charliepark.org/mackenzie_time_inventory/",
      "url": "https://charliepark.org/mackenzie_time_inventory/",
      "content_html": "<h1>The Mackenzie Time Inventory</h1><p>In the management classic <em>The Time Trap</em>, R. Alec Mackenzie has several solid recommendations, including getting a sense of where your time goes. He recommends creating and using a time inventory:</p><blockquote><p>From the earliest efforts to log their time, executives have found that their time allotments were not going where they thought they were. …</p><p>Peter Drucker’s remarks about the time log are enlightening. He observes that approaches to getting more work done always begin with planning. However, effective executives do not start this way. They know that if you start with a plan, it ends up in the bottom drawer. Other plans will follow, winding up in the same place. Instead, according to Drucker, <strong>the astute executive begins by finding out where [their] time is really going.</strong></p><p>The time inventory, or log, is necessary because <strong>the painful task of changing our habits requires far more conviction than we can build from learning about the experience of others.</strong> We need the amazing revelation of the great portions of time we are wasting to provide the determination to manage ourselves more effectively in this respect.</p></blockquote><p>In the book, Mackenzie lays out a chart that you can use to log your time. It wasn’t a bad layout for 1972, but as we have some more tools at our disposal, I figured it’d make for a solid spreadsheet.</p><p>So! I made one, using Google Sheets. If you’re interested, you can copy (and use) <a href='https://docs.google.com/spreadsheets/d/1fpmrTxIEv4ZF6kVMSo4OJbWVefulFR-vcgQ2IbcSSk8/edit?usp=sharing'>The Mackenzie Time Inventory</a>.</p><p>Let me know if you use it, and how it could be improved!</p>"
    },
  
    {
      "id": "https://charliepark.org/the_right_thing/",
      "url": "https://charliepark.org/the_right_thing/",
      "content_html": "<p>If doing the right thing were always easy, there wouldn’t be so many people doing the wrong things. Doing the right thing even when it has negative personal consequences is the mark of good character.</p><p><a href='https://www.reddit.com/r/relationship_advice/comments/ixplv5/updatemy26m_brother29m_is_married_to_and_cheating/g685sh7/'>jimmyjrdanceparty</a></p>"
    },
  
    {
      "id": "https://charliepark.org/the_has_selector/",
      "url": "https://charliepark.org/the_has_selector/",
      "content_html": "<p>No browsers support it yet, but there’s a useful pseudo-class in the CSS spec that I just stumbled on: <code>:has()</code></p><p>Say you have a style that applies to links, but you don’t want it to apply to links when they contain an image (like an image that links to a gallery). You could do something like this:</p><pre class='language-css'><code class='language-css'><span class='token selector'>a</span> <span class='token punctuation'>{</span> <span class='token property'>border-bottom</span><span class='token punctuation'>:</span> 1px solid #000 <span class='token punctuation'>}</span><br><span class='token selector'>a:has(img)</span> <span class='token punctuation'>{</span> <span class='token property'>border</span><span class='token punctuation'>:</span> none <span class='token punctuation'>}</span></code></pre>"
    },
  
    {
      "id": "https://charliepark.org/adhd_wearables/",
      "url": "https://charliepark.org/adhd_wearables/",
      "content_html": "<p>So this is pretty cool.</p><p><img src='/images/unicorn.jpg' alt='A wearable device to help identify decision moments.'></p><p>Annouk Wipprecht is a fashion designer / engineer who creates wearable devices like the one above. That one in particular is interesting to me, as it focuses on helping identify moments when kids with ADHD “engage”. From <a href='https://spectrum.ieee.org/geek-life/hands-on/i-built-a-brain-computer-interface-for-tackling-adhd-in-children'>a writeup on “Agent Unicorn”</a>:</p><blockquote><p>I decided to focus on what is known as the P300 event-related brain potential signal. P300 is a frequent focus of clinical exams and BCI research. It is a voltage pulse, often thought to be connected to attention and decision making, that occurs a few hundred milliseconds after an external stimulus. The P300 signal is often measured when diagnosing children with ADHD because the signal takes longer to manifest and isn’t as strong as it is in children without ADHD.</p><p>ADHD is commonly treated with stimulants such as Adderall that can boost concentration and focus while reducing hyperactive and impulsive behaviors. But while medication might help soothe symptoms, it doesn’t help in understanding why a child with ADHD is more prone to react to certain stimuli, or how their symptoms might be treated in a way that reduces reliance on drugs.</p><p>My goal was to create a device that would provide the data needed for such insights by monitoring both the brains of children and their environments. The result was Agent Unicorn—a headpiece with a projecting horn. The horn contains an 8-megapixel camera that records video during states of heightened P300 activity, as detected by an EEG built into the headpiece itself. The headpiece has a shape that automatically positions the electrodes at the correct locations on the skull.</p></blockquote><p>Here’s what it looks like when it’s going on a child:</p><p><img src='/images/unicorn_in_situ.jpg' alt='The device's inventor, Annouk Wipprecht, putting the Agent Unicorn device on a child in a classroom.'></p><p>Annouk Wipprecht has some more cool photos of her work in a gallery <a href='https://www.anoukwipprecht.nl/gallery/'>on her site</a>.</p>"
    },
  
    {
      "id": "https://charliepark.org/the_balancing_act/",
      "url": "https://charliepark.org/the_balancing_act/",
      "content_html": "<p>In a great thread on Twitter, Kieran Snyder shares <a href='https://twitter.com/KieranSnyder/status/1308128945447944192'>some great management insights</a>:</p><blockquote><p>The second mistake: Getting the balance wrong between managing up (working w your managers), managing down (working w your team), and managing over (working w your peers).</p><p>Most managers do one of these very well. Some do 2 out of the 3. Few get all 3 right with equal facility.</p><p>But all 3 of these working modes (managing up, down, and over) are important to achieving your main accountability as a manager: Delivering high-impact work on time and growing people in the process.</p><p>If you don’t spend enough time with your team, you fail to set accountabilities and priorities properly and you miss coaching opportunities.</p><p>If you don’t spend enough time with your management, you fail to set priorities properly, and you are likely missing context that can help your team. You also miss chances to be coached.</p><p>If you don’t spend enough time with your peers, your execution will suffer. You won’t know how your team is performing or perceived. You will lack organizational support for initiatives that matter to you.</p><p>At most stages of my early management career, I spent plenty of time with my team and with my management, but I didn’t spend enough time with my peers. That was an Achilles heel that I was only able to see after the fact.</p></blockquote><p>This is really insightful. I’ve talked with folks before about managers usually only being good at one, <em>maybe</em> two of “politics, product, process, or people”, but I think the look at managing up, down, and across is a great one.</p><p>In my last role, I nailed the “working with your team” piece, and did a really good job with the “peers” bit as well. In hindsight, that “managing up” piece was one I should have paid more attention to. Something learned for next time.</p>"
    },
  
    {
      "id": "https://charliepark.org/smarter_permalinks_in_eleventy/",
      "url": "https://charliepark.org/smarter_permalinks_in_eleventy/",
      "content_html": "<h1>Smarter Permalinks in Eleventy</h1><p>I’m continuing to enjoy Eleventy. The other day I noted that I was having trouble getting the dates to work correctly, and was hoping for some smarter autoslugging.</p><p>I figured out both, and wanted to share what I did.</p><p>I <em>had</em> been naming the date and permalink in the file’s header …</p><pre class='language-js'><code class='language-js'><span class='token operator'>--</span><span class='token operator'>-</span><br>date<span class='token operator'>:</span> <span class='token string'>'2020-09-21'</span><br>permalink<span class='token operator'>:</span> <span class='token string'>'smarter_permalinks_in_eleventy/'</span><br><span class='token operator'>--</span><span class='token operator'>-</span></code></pre><p>… but that’s duplicating the data in the filename (which was <code>2020-09-21_smarter_permalinks_in_eleventy.md</code>. This would be easier if eleventy <em>just knew</em> what the date and slug should be, right?</p><p>The date part was pretty easy. I removed the <code>date</code> line from the frontmatter data, and, as long as the filename had that YYYY-MM-DD formatting, it worked properly. (Thank you, eleventy, for being smart about that!) I’m still a little unsure that the UTC / PST timezones will play nicely, but it hasn’t shown to be a problem yet. (For some reason the “eleventy will automatically handle filenames with YYYY-MM-DD in them” wasn’t working for me a few days ago. Now it’s fine. ¯\\_(ツ)_/¯ )</p><p>For the permalink, I created a new line in my <code>eleventy.js</code> file …</p><pre class='language-js'><code class='language-js'>eleventyConfig<span class='token punctuation'>.</span><span class='token function'>addFilter</span><span class='token punctuation'>(</span><span class='token string'>'getPermalink'</span><span class='token punctuation'>,</span> <span class='token punctuation'>(</span><span class='token parameter'>page</span><span class='token punctuation'>)</span> <span class='token operator'>=></span> page<span class='token punctuation'>.</span>fileSlug<span class='token punctuation'>.</span><span class='token function'>slice</span><span class='token punctuation'>(</span><span class='token number'>11</span><span class='token punctuation'>)</span><span class='token punctuation'>)</span><span class='token punctuation'>;</span></code></pre><p>… and then added a line to my <code>posts/posts.json</code> file:</p><pre class='language-js'><code class='language-js'><span class='token string'>'permalink'</span><span class='token operator'>:</span> <span class='token string'>'{{ page | getPermalink }}/index.html'</span><span class='token punctuation'>,</span><br></code></pre><p>Now the data and autoslug are generated off of the file name, and my post frontmatter only needs to exist if I’m specifying the post “type” (image, quote, poem, etc.). No more duplicated data.</p>"
    },
  
    {
      "id": "https://charliepark.org/quiet_family_life/",
      "url": "https://charliepark.org/quiet_family_life/",
      "content_html": "<p><img src='/images/moomin.jpg' alt='A panel of the Moomin comic, showing characters sitting around a table. The mother figure says &quot;Isn't this quiet family life wonderful, dear?&quot; The father figure, looking bored, says &quot;Yes … … … but it would be even more wonderful if something exciting and awful happened!&quot;'></p>"
    },
  
    {
      "id": "https://charliepark.org/you_shouldve_asked/",
      "url": "https://charliepark.org/you_shouldve_asked/",
      "content_html": "<p>This is one of my favorite comics of all time, and it only takes about five minutes to read.</p><p>Every time I read it, it makes me a better person and a better partner.</p><p><a href='https://english.emmaclit.com/2017/05/20/you-shouldve-asked/'>You Should’ve Asked</a></p>"
    },
  
    {
      "id": "https://charliepark.org/everything/",
      "url": "https://charliepark.org/everything/",
      "content_html": "<p>Late last night, inspecting Santa’s handiwork, a simple thought occurred to me. A decade or so from now, when, say, I’m waiting for my son to come home from college for his winter break, and, when he does, he wants to spend his time going out with his friends — how much will I be willing to pay then to be able to go back in time, for one day, to now, when he’s eight years old, he wants to go to movies and play games and build Lego kits with me, and he believes in magic?</p><p>How much then, for one day with what my family has right now? How much? Everything.</p><p><a href='https://daringfireball.net/2011/12/merry'>John Gruber</a></p>"
    },
  
    {
      "id": "https://charliepark.org/rbg/",
      "url": "https://charliepark.org/rbg/",
      "content_html": "<img src='/images/rbg_necklace.png' alt='A picture of Ruth Bader Ginsburg's iconic collar, but in black.' style='max-width: 180px'><p>She fought. And fought. And fought.</p><p>We have to do the same.</p>"
    },
  
    {
      "id": "https://charliepark.org/three_days_in/",
      "url": "https://charliepark.org/three_days_in/",
      "content_html": "<h1>Three Days In</h1><p>I’m three days into using <a href='https://github.com/charliepark/tumblelog/'>this tumblelogging tool</a>, and am pretty happy with it. Obviously, the test is how I’ll use it over time, but things are going well so far.</p><h2>A few things I love</h2><h3>It’s great how low-stress it is</h3><blockquote><p>I don’t worry about whether things are “good enough” to post. I just post them. That’s a big improvement over what I had before, where I let the perfect be the enemy of the good, and, consequently, didn’t post.</p></blockquote><h3>The different formatting types are fun</h3><blockquote><p>I love being able to come up with new post types, and then to style them independently. For example, yesterday, when I added the “poem” type. I’ll come up with a few more, for sure. I still haven’t come up with the “link” format, but look forward to the occasion where I do.</p></blockquote><h3>Posting and hosting are both easy</h3><blockquote><p>It’s really easy to add a new post right now. Create a file with the right Markdown format and frontmatter, run <code>eleventy --serve</code> to see what it looks like, and then commit to git and push remote. (TBH, I actually just leave an iTerm window open with <code>eleventy --serve</code> going all the time.)</p></blockquote><blockquote><p>The workflow is a little dependent on VS Code, where I’m writing these, and running eleventy on my local machine. And I have a few ideas around requiring less of the template in the Markdown file that I need to play with. But it’s working for now.</p></blockquote><h2>Some things to work on</h2><h3>Less metawork</h3><aside class='callout_box'>  <p><b>Update:</b> I’ve fixed this now! See here for more: <a href='/smarter_permalinks_in_eleventy'>Smarter Permalinks in Eleventy</a></p></aside><blockquote><p>Right now I have a bit of duplication of effort, in that I name the file something like <code>2020_09_18_three_days_in.md</code> and then add metadata like</p></blockquote><pre class='language-text'><code class='language-text'>---<br>date: '2020-09-18'<br>permalink: 'three_days_in/'<br>---</code></pre><blockquote><p>The eleventy docs say that it’ll use any YYYY-MM-DD in the file name as a date, but I haven’t found that to be the case (I know my date in the filename is using underscores; even when using dashes it doesn’t seem to quite work). It’d be nice to add something to the compiler / preferences that interpreted the filename correctly and then just used it for the date and permalink. Perhaps there’s a way to configure that, and I just haven’t found it yet.</p></blockquote><h3>Mmmmmaybe a posting interface?</h3><blockquote><p>I can imagine a Svelte app that gives an easy posting input. Name the permalink, adjust the date if needed (but default to now), and give an input field for posting the content. Write the .md file on submission, then run <code>eleventy</code> to process it. At that point, you could just add a button that pushes it to GitHub as well. That’d be pretty cool.</p></blockquote><h3>RSS, or posting to Twitter, etc.</h3><blockquote><p>Right now, hardly anybody knows about this tumblelog, and that’s fine. (Hi, folks who are here!) But I could see it being useful to have some sort of “push this content to Twitter”. I’m not sure how that works with eleventy, and it’s possible there isn’t a convenient hook to do that. But it’d be cool to have that as an option. Maybe it’d be another bit of metadata in the header — if <code>post_to_twitter: true</code>, push it.</p></blockquote><h3>Social?</h3><blockquote><p>I’ve realized that one of the things that Tumblr did well was to give you a place to both create and consume. Twitter, too. Right now, this is just a place where I publish stuff. If I ever decide to make this more of a thing, it’d be helpful to have a place where I can read other people’s stuff, too. (I’ve always wondered why RSS readers don’t also give you a way to publish your own stuff. [Or maybe they do! Dunno!])</p></blockquote><h3>Separating <em>my</em> instance of this from the tool to let you do it yourself</h3><blockquote><p>When I wrote my two-times-ago blog, in Jekyll, a lot of people cloned it on GitHub, I believe to help them with a tagging issue that I solved. The problem was that I began to get worried about changing my blog (because it might mess up other peoples’ stuff?). That’s kind of silly. But if I ever do make this a more general-purpose tool for folks, I’ll want to figure out the best way to split them up. Very do-able; I just haven’t had to think through that piece yet.</p></blockquote><h2>So.</h2><p>So that’s where things are right now. It’s still fun, and I’m enjoying it. And I have a few clear ”next thing to work on”s.</p><p>If you have any feedback, let me know! My DMs on Twitter (@charliepark) are open, though I’m on a bit of a Twitter break at the moment. Nevertheless, say hi!</p>"
    },
  
    {
      "id": "https://charliepark.org/the_big_one/",
      "url": "https://charliepark.org/the_big_one/",
      "content_html": "<h1>There are fires during wartime, too.</h1><p>There’s a scene in the film <em>Hope and Glory</em> that I think about a lot. Thirty seconds of DDGing haven’t brought up either a clip or a quote, so you’ll have to take my word for what goes on in the scene.</p><p>The film takes place during World War II, in London. Some of the more exciting bits of the film take place during air raids, where German planes drop carpet bombs on the city.</p><p>One night, the family’s out, at a play, or something. They return home, and their house is completely engulfed in flames.</p><p>The mother, horror-struck, turns to the fire chief. “But I didn’t hear the air raid sirens!”</p><p>“There wasn’t an air raid, Ma'am.”</p><p>“But the fire?!”</p><p>“There are fires during wartime too, Ma’am.”</p><p>There are fires during wartime, too.</p><p>It’s tempting — in the middle of a global pandemic AND historic wildfires AND an impending consitutional crisis — to say “Well, damn. It can’t get worse, right?”</p><p>Here’s the thing. Geology doesn’t care about any of that, and we’re just as likely to have a major earthquake during a global pandemic as we are at any other time. The odds haven’t improved just because everything else has gotten terrible.</p><p>If you live in California, I highly recommend the following podcast. It’s nine episodes, each a little over half an hour, produced by KPCC, Southern California Public Radio. It’s sobering, and could save your life.</p><iframe src='https://open.spotify.com/embed-podcast/show/3yaIsM9h6jPJn9d2FRNKVe' width='100%' height='232' frameborder='0' allowtransparency='true' allow='encrypted-media'></iframe><p>Also, connect with your local CERT / <a href='https://sf-fire.org/neighborhood-emergency-response-team-nert'>NERT</a> group and get trained!</p>"
    },
  
    {
      "id": "https://charliepark.org/egg/",
      "url": "https://charliepark.org/egg/",
      "content_html": "<h1>Egg</h1><p>by C.G. Hanzlicek</p><p>I’m scrambling an egg for my daughter.<br />“Why are you always whistling?” she asks.<br />“Because I’m happy.”<br />And it’s true,<br />Though it stuns me to say it aloud;<br />There was a time when I wouldn’t<br />Have seen it as my future.<br />It’s partly a matter<br />Of who is there to eat the egg:<br />The self fallen out of love with itself<br />Through the tedium of familiarity,<br />Or this little self,<br />So curious, so hungry,<br />Who emerged from the woman I love,<br />A woman who loves me in a way<br />I’ve come to think I deserve,<br />Now that it arrives from outside me.<br />Everything changes, we’re told,<br />And now the changes are everywhere:<br />The house with its morning light<br />That fills me like a revelation,<br />The yard with its trees<br />That cast a bit more shade each summer,<br />The love of a woman<br />That both is and isn’t confounding,<br />And the love<br />Of this clamor of questions at my waist.<br />Clamor of questions,<br />You clamor of answers,<br />Here’s your egg.<br /></p>"
    },
  
    {
      "id": "https://charliepark.org/the_familiar_and_the_new/",
      "url": "https://charliepark.org/the_familiar_and_the_new/",
      "content_html": "<p>One of my philosophies as a designer is that you should first start with the patterns that exist, and only break the rules little by little, in the right places. When [you] don’t break enough patterns, you end up with something boring and predictable. But when you break too many, you end up with something chaotic and confusing. There is a sweet spot, and it contains both the familiar and the new.</p><p>Jack Cheng (<a href='https://www.kickstarter.com/projects/jackcheng/these-days-a-novel/posts/347012'>here</a>, though post is only available to Kickstarter backers)</p>"
    },
  
    {
      "id": "https://charliepark.org/the_library/",
      "url": "https://charliepark.org/the_library/",
      "content_html": "<p><img src='/images/the_library_a_great_place_to_get_checked_out.jpg' alt='The Library: A good place to get checked out.'></p>"
    },
  
    {
      "id": "https://charliepark.org/september_15/",
      "url": "https://charliepark.org/september_15/",
      "content_html": "<iframe width='560' height='315' src='https://www.youtube.com/embed/n2nI60dpQg0' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe><p>It being September 15th, we remember four little girls from Birmingham — Addie Mae Collins, Cynthia Wesley, Carole Robertson, Carol Denise McNair — and twenty years later, a man from Spanish Town, Prince Far I.</p>"
    },
  
    {
      "id": "https://charliepark.org/hello_tumblelog/",
      "url": "https://charliepark.org/hello_tumblelog/",
      "content_html": "<h1>Hello, tumblelog</h1><p>This is just a quick afternoon project I threw together, to play a bit more with Eleventy (<a href='https://www.11ty.dev/'>11ty</a>) and <a href='http://netlify.com/'>Netlify</a>.</p><p>The goal was to create a very basic tumblelog, which most of the world knew as “the kind of microblog that Tumblr made”. Which isn’t <em>wrong</em>. But there were tumblelogs before Tumblr, and, I guess, after Tumblr as well.</p><p>I think I’ve been hesitant to do much with my main website because … it feels like my homepage should be SeRiOuS. Which, yeah, maybe. But it’s also kind of dead right now.</p><p>So! I’m going to try this out and see if it works. If it does, I’ll look into moving my main blog over to this.</p><p>Development went pretty well. I’ve built a few things with Eleventy before. I have to say, every time I start fresh with it I have to wrestle with the docs a fair amount. A lot of it’s really straightforward and clear. But something as basic as “how do I post a copy of each post’s content on the main page?” is somehow hard to search for. (The answer, by the way, is something like this:</p><pre class='language-html'><code class='language-html'>{%- for post in collections.all | reverse -%}<br><span class='token tag'><span class='token tag'><span class='token punctuation'>&lt;</span>article</span> <span class='token attr-name'>class</span><span class='token attr-value'><span class='token punctuation attr-equals'>=</span><span class='token punctuation'>'</span>{{ post | setClasses }}<span class='token punctuation'>'</span></span><span class='token punctuation'>></span></span><br>{%- if post.data.date %}<br>  <span class='token tag'><span class='token tag'><span class='token punctuation'>&lt;</span>time</span> <span class='token attr-name'>class</span><span class='token attr-value'><span class='token punctuation attr-equals'>=</span><span class='token punctuation'>'</span>postdate<span class='token punctuation'>'</span></span> <span class='token attr-name'>datetime</span><span class='token attr-value'><span class='token punctuation attr-equals'>=</span><span class='token punctuation'>'</span>{{ post.data.date | getISOString }}<span class='token punctuation'>'</span></span><span class='token punctuation'>></span></span><br>    <span class='token tag'><span class='token tag'><span class='token punctuation'>&lt;</span>a</span> <span class='token attr-name'>href</span><span class='token attr-value'><span class='token punctuation attr-equals'>=</span><span class='token punctuation'>'</span>{{ post.url }}<span class='token punctuation'>'</span></span><span class='token punctuation'>></span></span>{{ post.data.date | getHumanDate }}<span class='token tag'><span class='token tag'><span class='token punctuation'>&lt;/</span>a</span><span class='token punctuation'>></span></span><br>  <span class='token tag'><span class='token tag'><span class='token punctuation'>&lt;/</span>time</span><span class='token punctuation'>></span></span><br>{%- endif %}<br>  <span class='token tag'><span class='token tag'><span class='token punctuation'>&lt;</span>div</span> <span class='token attr-name'>class</span><span class='token attr-value'><span class='token punctuation attr-equals'>=</span><span class='token punctuation'>'</span>postbody<span class='token punctuation'>'</span></span><span class='token punctuation'>></span></span><br>    {{ post.templateContent | safe }}<br>  <span class='token tag'><span class='token tag'><span class='token punctuation'>&lt;/</span>div</span><span class='token punctuation'>></span></span><br><span class='token tag'><span class='token tag'><span class='token punctuation'>&lt;/</span>article</span><span class='token punctuation'>></span></span><br>{%- endfor -%}<br></code></pre><p>Oh! And that datetime format is handled like this, in your eleventy config file:</p><pre class='language-js'><code class='language-js'><span class='token keyword'>const</span> <span class='token function-variable function'>setDateToMidnight</span> <span class='token operator'>=</span> <span class='token punctuation'>(</span><span class='token parameter'>date</span><span class='token punctuation'>)</span> <span class='token operator'>=></span> <span class='token punctuation'>(</span><span class='token keyword'>new</span> <span class='token class-name'>Date</span><span class='token punctuation'>(</span>date<span class='token punctuation'>)</span><span class='token punctuation'>)</span><span class='token punctuation'>.</span><span class='token function'>toUTCString</span><span class='token punctuation'>(</span><span class='token punctuation'>)</span><span class='token punctuation'>;</span><br><br><span class='token keyword'>const</span> <span class='token function-variable function'>getISOString</span> <span class='token operator'>=</span> <span class='token punctuation'>(</span><span class='token parameter'>date</span><span class='token punctuation'>)</span> <span class='token operator'>=></span> <span class='token punctuation'>{</span><br>  <span class='token keyword'>const</span> midnight <span class='token operator'>=</span> <span class='token function'>setDateToMidnight</span><span class='token punctuation'>(</span>date<span class='token punctuation'>)</span><span class='token punctuation'>;</span><br>  <span class='token keyword'>return</span> <span class='token keyword'>new</span> <span class='token class-name'>Date</span><span class='token punctuation'>(</span>midnight<span class='token punctuation'>)</span><span class='token punctuation'>.</span><span class='token function'>toISOString</span><span class='token punctuation'>(</span><span class='token punctuation'>)</span><span class='token punctuation'>;</span><br><span class='token punctuation'>}</span><span class='token punctuation'>;</span><br><span class='token keyword'>const</span> <span class='token function-variable function'>getHumanDate</span> <span class='token operator'>=</span> <span class='token punctuation'>(</span><span class='token parameter'>date</span><span class='token punctuation'>)</span> <span class='token operator'>=></span> <span class='token punctuation'>{</span><br>  <span class='token keyword'>const</span> midnight <span class='token operator'>=</span> <span class='token function'>setDateToMidnight</span><span class='token punctuation'>(</span>date<span class='token punctuation'>)</span><span class='token punctuation'>;</span><br>  <span class='token keyword'>return</span> <span class='token keyword'>new</span> <span class='token class-name'>Date</span><span class='token punctuation'>(</span>midnight<span class='token punctuation'>)</span><span class='token punctuation'>.</span><span class='token function'>toLocaleString</span><span class='token punctuation'>(</span><span class='token string'>'en-us'</span><span class='token punctuation'>,</span> <span class='token punctuation'>{</span><br>    month<span class='token operator'>:</span> <span class='token string'>'long'</span><span class='token punctuation'>,</span><br>    day<span class='token operator'>:</span> <span class='token string'>'numeric'</span><span class='token punctuation'>,</span><br>    year<span class='token operator'>:</span> <span class='token string'>'numeric'</span><span class='token punctuation'>,</span><br>    timeZone<span class='token operator'>:</span> <span class='token string'>'UTC'</span><br>  <span class='token punctuation'>}</span><span class='token punctuation'>)</span><span class='token punctuation'>;</span><br><span class='token punctuation'>}</span><span class='token punctuation'>;</span><br><br>module<span class='token punctuation'>.</span><span class='token function-variable function'>exports</span> <span class='token operator'>=</span> <span class='token keyword'>function</span> <span class='token punctuation'>(</span><span class='token parameter'>eleventyConfig</span><span class='token punctuation'>)</span> <span class='token punctuation'>{</span><br>  eleventyConfig<span class='token punctuation'>.</span><span class='token function'>addFilter</span><span class='token punctuation'>(</span><span class='token string'>'getHumanDate'</span><span class='token punctuation'>,</span> <span class='token punctuation'>(</span><span class='token parameter'>date</span><span class='token punctuation'>)</span> <span class='token operator'>=></span> <span class='token function'>getHumanDate</span><span class='token punctuation'>(</span>date<span class='token punctuation'>)</span><span class='token punctuation'>)</span><span class='token punctuation'>;</span><br>  eleventyConfig<span class='token punctuation'>.</span><span class='token function'>addFilter</span><span class='token punctuation'>(</span><span class='token string'>'getISOString'</span><span class='token punctuation'>,</span> <span class='token punctuation'>(</span><span class='token parameter'>date</span><span class='token punctuation'>)</span> <span class='token operator'>=></span> <span class='token function'>getISOString</span><span class='token punctuation'>(</span>date<span class='token punctuation'>)</span><span class='token punctuation'>)</span><span class='token punctuation'>;</span><br><span class='token punctuation'>}</span></code></pre><p>Note the <code>timeZone: 'UTC'</code> bit in the <code>toLocaleString()</code> options! It’s pretty important!</p>"
    }
  
  ]
}